config.org
** Neotree **
#+begin_src emacs-lisp
  (windmove-default-keybindings)
  (use-package neotree
     :ensure t
     :config
     (global-set-key [f8] 'neotree-toggle)
     (setq neo-window-fixed-size nil)
     (setq neo-window-width 20)
     (setq projectile-switch-project-action 'neotree-projectile-action))
#+end_src


#+end_src
** Install and configure clojure and cider
#+begin_src emacs-lisp
  (use-package idle-highlight-mode
    :config
    (add-hook 'prog-mode-hook
              (lambda ()
                (idle-highlight-mode t))))

  (use-package smartparens
    :defer t
    :ensure t
    :diminish smartparens-mode
    :init
    (setq sp-override-key-bindings
          '(("C-<right>" . nil)
            ("C-<left>" . nil)
            ("C-)" . sp-forward-slurp-sexp)
            ("M-<backspace>" . nil)
            ("C-(" . sp-forward-barf-sexp)))
    :config
    (sp-use-smartparens-bindings)
    (sp--update-override-key-bindings)
    :commands (smartparens-mode show-smartparens-mode))

  (use-package cider-eval-sexp-fu
    :defer t)

  (use-package clj-refactor
    :defer t
    :ensure t
    :diminish clj-refactor-mode
    :config (cljr-add-keybindings-with-prefix "C-c C-m"))

  (use-package cider
    :ensure t
    :defer t
    :init (add-hook 'cider-mode-hook #'clj-refactor-mode)
    :diminish subword-mode
    :config
    (setq nrepl-log-messages t
          cider-repl-display-in-current-window t
          cider-repl-use-clojure-font-lock t
          cider-prompt-save-file-on-load 'always-save
          cider-font-lock-dynamically '(macro core function var)
          nrepl-hide-special-buffers t
          cider-overlays-use-font-lock t)
    (add-hook 'cider-repl-mode-hook #'cider-company-enable-fuzzy-completion)
    (add-hook 'cider-mode-hook #'cider-company-enable-fuzzy-completion)
    (cider-repl-toggle-pretty-printing))

  ;; First install the package:
  (use-package flycheck-clj-kondo
    :ensure t)

  (use-package flycheck-joker
    :ensure t)

  (use-package clojure-mode
    :ensure t
    :mode (("\\.clj\\'" . clojure-mode)
           ("\\.edn\\'" . clojure-mode))
    :config
    (setq clojure-align-forms-automatically t)
    (show-paren-mode 1)
    (setq-default blink-matching-paren nil
                  show-paren-style 'parenthesis
                  show-paren-delay 0)
    (require 'flycheck-joker)
    (require 'flycheck-clj-kondo)
    (dolist (checker '(clj-kondo-clj clj-kondo-cljs clj-kondo-cljc clj-kondo-edn))
    (setq flycheck-checkers (cons checker (delq checker flycheck-checkers))))
    (dolist (checkers '((clj-kondo-clj . clojure-joker)
                        (clj-kondo-cljs . clojurescript-joker)
                        (clj-kondo-cljc . clojure-joker)
                        (clj-kondo-edn . edn-joker)))
                        (flycheck-add-next-checker (car checkers) (cons 'error (cdr checkers))))
    :init
    (add-hook 'clojure-mode-hook #'linum-mode)
    (add-hook 'clojure-mode-hook #'subword-mode)
    (add-hook 'clojure-mode-hook #'paredit-mode)
    (add-hook 'clojure-mode-hook #'cider-mode)
    (add-hook 'clojure-mode-hook #'rainbow-delimiters-mode)
    (add-hook 'clojure-mode-hook #'eldoc-mode)
    (add-hook 'clojure-mode-hook #'flycheck-mode)
    (add-hook 'clojure-mode-hook #'idle-highlight-mode)
    (add-hook 'clojure-mode-hook #'hs-org/minor-mode))
#+end_src
